<template>
  <el-card class="container">
    <div slot="header" class="clearfix">
      <span class="title">孕妈知识库</span>
    </div>
    <div v-if="!isDetail">
      <div class="topic">关于顺产</div>
      <div v-for="(o, i) in sData" :key="i" class="item" @click="toDetail(o)">
        <i class="el-icon-caret-right"></i>
        {{ o.title }}
      </div>

      <div class="topic">关于剖腹产</div>
      <div v-for="(o, i) in pData" :key="i" class="item" @click="toDetail(o)">
        <i class="el-icon-caret-right"></i>
        {{ o.title }}
      </div>
    </div>

    <div v-if="isDetail">
      <div class="detail-title">
        <el-button style="float: left" plain @click="isDetail = false">返回</el-button>
        {{ current.title }}
      </div>
      <div class="content">
        {{ current.content }}
      </div>
    </div>
  </el-card>
</template>

<script>
export default {
  name: "knowledge",
  data() {
    return {
      isDetail: false,
      current: {},
      sData: [
        { title: '关于产妇的年龄', content: '年龄在二十四到二十八岁之间，属于是适合顺产的阶段，一般来说，少于这个年龄段的女性，身体各个部位的组织发育不够完善，尤其是骨盆的形状，还没有固定好，会对母体和胎儿的健康造成影响。\n' +
              '年龄过大的女性，属于高龄产妇，她们的骨盆关节会变硬，不利于扩张，而且子宫收缩力和阴道张力也不好，所以分娩时间较长，容易发生在分娩期间，所以适合生产年龄也很有利于分娩。' },
        { title: '产妇的饮食', content: '营养孕期注意饮食营养，合理控制体重。\n' +
              '孕妇非常重视食物营养，如果不注意控制体重，饮食上营养过盛，那么就很容易造成，脂肪摄入过多，并且还会对腹部胎儿发育造成影响，而且在生产的时候，也会受到一定的影响，只能依靠手术。' },
        { title: '适当的运动', content: '在怀孕期间要保持适当的运动，运动不仅利于身体健康，对顺产也有一定的帮助，是一种有利于自然分娩的方式，可以缩短分娩过程，减少难产的发生。\n' +
              '经常运动的准妈妈通常能保持身体健康和心肺功能在一定程度上，对孕妇的身体健康耐受性很高，能承受分娩时的疼痛比较好，所以女运动员比普通孕妇分娩并发症要少得多。因此，准妈妈可以保持平时的锻炼习惯，只要注意不要选择紧张的项目就行了。' },
        { title: '定期产检', content: '定期产前检查，也有助于生产。事实上，很多时候只要它对自然出生很有信心，其实它已经成功了一半。\n' +
              '只要对自然分娩有信心，配合医生，这样就可以让分娩得到一半努力的两倍结果，而定期产前检查是能够帮助医生尽早发现问题，能迅速纠正和治愈，让自然分娩能够顺利进行' },
        { title: '无痛分娩', content: '无痛分娩”起源于国外，至今有100余年的历史，目前它在国外已经应用很普遍了，美国分娩镇痛率>85%，英国>90%。国内很多医院均已开展无痛分娩，有的已经占了顺产的30%～40%的比例，准妈妈可以放心选用无痛分娩，这是一项简单易行、安全成熟的技术。\n' +
              '目前的分娩镇痛方法包括非药物性镇痛和药物性镇痛两大类。非药物性镇痛包括精神安慰法、呼吸法、水中分娩等，其优点是对产程和胎儿无影响，但镇痛效果较差；药物性镇痛包括笑气吸入法、肌注镇痛药物法、椎管内分娩镇痛法等。\n' +
              '椎管内分娩镇痛是迄今为止所有分娩镇痛方法中镇痛效果最确切的方法，这种操作由有经验的麻醉医师进行。麻醉医师在腰椎间隙进行穿刺成功后，在蛛网膜下腔注入少量局麻药或阿片类药物，并在硬膜外腔置入一根细导管，导管的一端连接电子镇痛泵，由产妇根据疼痛的程度自我控制给药（麻醉医师已经设定好了每小时的限量，不必担心用药过量），镇痛泵可以持续使用直至分娩结束。\n' +
              '在整个过程中，麻醉药的浓度较低，相当于剖宫产麻醉时的1/5～1/10，可控性强，安全性高，几乎不影响产妇的运动，产妇意识清醒，能主动配合、积极参与整个分娩过程。这种无痛分娩法是目前各大医院运用最广泛、效果比较理想的一种。\n' +
              '在给产妇施行分娩镇痛麻醉时，要考虑不影响产程和胎儿安全的原则下，通过严格地给予镇痛药物，不影响子宫规律性收缩，即可阻断分娩时的痛觉神经传递，从而达到避免或减轻分娩痛苦的目的，把分娩疼痛降到最低，但保留子宫收缩和有轻微痛感。\n' +
              '“无痛分娩”并不是整个产程的无痛。处于安全的考虑，目前国内多数医院的分娩镇痛是在宫口开到2～3cm时进行椎管内阻滞。产妇的精神状态若处于紧张、恐惧、焦虑、信心不足之中，也会增加对疼痛的敏感度，因此，做好精神上的准备也是减轻疼痛感的一个好方法。不管用什么方法都很难做到绝对不痛，它的应用是让难以忍受的子宫收缩阵痛变为可忍受，或只是感受子宫收缩而不痛。' },
        { title: '顺产三大产程', content: '经阴道自然分娩分为三个阶段（产程）。分娩痛主要出现于第一和第二产程。不同产程疼痛的神经传导通路不同。\n' +
              '1.第一产程是自规律子宫收缩开始到宫口开全为止，其间子宫体、子宫颈和阴道等组织出现巨大变化，胎头下降促使子宫下段、宫颈管和宫口呈进行性展宽、缩短、变薄和扩大，子宫肌纤维伸长和撕裂，圆韧带受强烈牵拉而伸长。\n' +
              '这些解剖结构的迅速变化构成强烈的刺激信号，刺激冲动由盆腔内脏传入神经纤维及相伴随的交感神经传入胸10、11、12和腰1脊髓节段，然后再经脊髓背侧束迅速上传至大脑，引起疼痛。疼痛部位主要在下腹部、腰部及骶部。第一产程疼痛的特点是：疼痛范围弥散不定，下腹部、腰背部出现紧缩感和酸胀痛，可放射至髋部。\n' +
              '2.第二产程是自宫颈口开全至胎儿娩出为止，此阶段除了子宫体的收缩及子宫下段的扩张外，胎儿先露部对盆腔组织的压迫以及会阴的扩张是引起疼痛的主要原因。\n' +
              '疼痛冲动经阴部神经传入骶2、3、4脊髓节段，并上传至大脑，构成典型的“躯体痛”，其疼痛性质与第一产程完全不同，表现为刀割样尖锐剧烈的疼痛，疼痛部位明确，集中在阴道、直肠和会阴部。\n' +
              '3.第三产程胎盘娩出，子宫容积缩小，宫内压力下降，会阴部的牵拉感消失，产妇会突然感到松解，产痛明显减轻。' },
        { title: '顺产优缺点', content: '优点\n' +
              '无痛分娩虽然在中国应用并不广泛，但是它在国外已经应用得很普遍了，准妈妈可以放心应用无痛分娩，这是一项简便易行、安全成熟的技术。\n' +
              '1.安全\n' +
              '无痛分娩采用椎管内阻滞，医生在产妇的腰部硬膜外腔放置导管，镇痛泵中麻醉药的浓度相当于剖宫产的1/5～1/10，即淡淡的麻药，是很安全的。\n' +
              '有非常详尽的研究证实，椎管内镇痛对产妇和胎儿是安全的。无痛分娩时用药剂量极低，只是剖宫产手术的1/5～1/10，因此进入母体血液、通过胎盘的机率微乎其微，对胎儿几乎也不会造成什么影响。当人体感到严重疼痛的时候，会释放一种叫儿茶酚胺的物质，这种物质对产妇和胎儿都有不利的影响，新生儿的血液和氧气供应都可能受到影响。所以，无痛分娩还能减少胎儿缺氧的危险。\n' +
              '2.方便\n' +
              '由于麻醉药的浓度很低，几乎不影响产妇的运动功能，因此在医生的允许下产妇可以下床活动；此外，产妇可以根据疼痛的程度自我控制给药，真正做到个体化，因此很方便。\n' +
              '3.药效持久\n' +
              '大约在给药10分钟后，产妇就感觉不到宫缩的强烈阵痛了，能感觉到的疼痛就好似是来月经时轻微的腹痛。给一次药，药效大约持续一个半小时，甚至更长，待有了疼痛感觉后产妇应用镇痛泵继续给药，自控控制镇痛，如此反复，直至分娩结束。\n' +
              '4.适合人群广\n' +
              '大多数产妇都适合于无痛分娩，但是如果合并凝血功能障碍、药物过敏、腰部有外伤史等疾病，产妇应向医生咨询，由医生来决定是否可以进行无痛分娩。\n' +
              '5.不用进手术室\n' +
              '无痛分娩的全过程是由麻醉医生和妇产科医生合作完成的，正常的无痛分娩在产房中即可进行，无需进手术室操作。\n' +
              '缺点\n' +
              '1.低血压\n' +
              '分娩镇痛采用椎管内阻滞（硬膜外、蛛网膜下腔阻滞或硬膜外-蛛网膜下腔联合阻滞）时，如收缩压降至<90mmHg，或比基础值降低20%～30%，称为低血压。其发生机制是下胸腰段脊神经阻滞后，腹肌松弛，妊娠子宫压迫下腔静脉导致静脉回流障碍，心排出量突然减少；此外，交感神经阻滞后，外周血管扩张也是引起血压下降的原因之一。\n' +
              '如低血压时间过长，可能导致胎盘血流灌注减少，胎儿低氧血症和酸血症等。因此，采用无痛分娩时首先要开放静脉输液，密切监测产妇血压、心率及呼吸的情况，同时行胎儿心率监测，避免阻滞平面过广。当出现低血压时，需将产妇置于左侧卧位，必要时静脉注射提升血压药物。\n' +
              '2.头痛\n' +
              '部分产妇硬膜穿破后脑脊液外漏而引起颅压降低会造成穿刺后头痛，发生后产妇需卧床休息，进行补液治疗等。这种头痛是自限性的，1周内多能自行缓解。\n' +
              '3.局麻药中毒\n' +
              '主要原因是局麻药误注入血管或因局麻药用量大，经局部血管吸收迅速引起。\n' +
              '4.全脊髓麻醉\n' +
              '穿刺过程中如果导管穿破硬脊膜而没有发现，就会使大量局麻药持续输注进入蛛网膜下腔发生全脊髓麻醉。由于硬膜外连续滴注或自控分娩镇痛时所使用的局麻药浓度很低，因此不容易在短时间内引起全脊髓麻醉。只要密切观察阻滞平面的变化，并监测血压、呼吸等生命体征，是能够及时发现和处理的。\n' +
              '5.神经损伤\n' +
              '主要的原因有胎头或胎儿在产道下降过程中，压迫盆腔产道后面的外周神经、或第二产程中下肢过曲、体位不当引起的，一般在3个月内能自动恢复。\n' +
              '6.产程延长\n' +
              '从一些间接的研究结果推论，第一产程在椎管内分娩镇痛情况下，变化不大，而第二产程可能延长15～20分钟，因此在宫口将近开全的时候需要减少药量。\n' +
              '7.其他\n' +
              '如嗜睡、头晕、恶心、呕吐、皮肤瘙痒、尿潴留等也较常见。' },
      ],
      pData: [
        { title: '剖腹产注意事项', content: '剖宫产注意事项如下：\n' +
              '第一、在术前要禁食水4-6个小时。\n' +
              '第二、剖宫产手术后要平卧6-8个小时，腹部切口加压，防止术后切口出血。\n' +
              '在平卧期间活动四肢、做下肢的按摩，避免血栓形成。\n' +
              '同时要观察阴道的流血情况，出血量多于平时月经的两倍，要及时的寻求帮助。\n' +
              '第三、术后要尽早的开奶，新生儿对乳头的吸吮可以促进子宫收缩，减少出血，提倡在手术后半个小时之内要尽早的进行早接触、早吸吮。\n' +
              '第四、术后6-8个小时可以在床上做翻身运动，同时可以进食少量的流食和半流食。\n' +
              '原则上的是先吃清淡、容易消化的饮食，逐渐过渡到正常饮食，少量多餐。\n' +
              '第五、手术后12个小时起床活动提倡，尽早下床多活动促进胃肠道蠕动，尽早排气促进术后恢复，同时减少肠粘连、静脉血栓等并发症的发生。\n' +
              '第六、拔出尿管后要尽量的解小便，如有小便不畅、尿不尽的症状，要及时的通知医护人员。\n' +
              '第七、剖宫产术后切口疼痛不方便坐，哺乳时可以采取侧卧哺喂新生儿，每2-3个小时哺乳一次，每次20-30分钟。\n' +
              '第八、注意腹部切口以及外阴的清洁、干燥。\n' +
              '第九、注意阴道出血、腹痛、发烧等等情况。' },
        { title: '剖腹产伤口护理', content: '' +
              '一、伤口未愈合前请勿弄湿或弄脏，万一弄湿的话，必须立即擦干，并涂上碘伏消炎。剖腹产伤口护理\n' +
              '二、剖腹产手术后三天内配合输液，以补足水分，纠正脱水状态。术后六小时可进食些炖蛋、蛋花汤、藕粉等流质食物。术后第二天可吃粥、鲫鱼汤等半流质食物。剖腹产伤口护理\n' +
              '三、咳嗽、恶心、呕吐时，应压住伤口两侧，防止缝线断裂。剖腹产伤口护理\n' +
              '四、下床时先行侧卧，以手支撑身体起床，避免直接用腹部力量坐起。手术一周后才可淋浴，之前可擦澡剖腹产伤口护理\n' +
              '五、不要因为伤口疼痛，而不肯动，适当的运动对于伤口的愈合还是非常有帮助的。剖腹产伤口护理\n' +
              '六、剖腹产后应该注意日常的饮食调理，多食用一些含有胶原蛋白、维生素丰富的食物，多食用一些含锌、铁丰富的食物，避免食用辛辣刺激性的食物，避免食用发物。剖腹产伤口护理\n' +
              '七、避免阳光直接曝晒伤口，使疤痕颜色加深。有结痂者勿用手抓，让其自然脱落，每天用手指头轻轻按摩伤口3到5分钟，减少疤痕产生。剖腹产伤口护理\n' +
              '八、如果患者由于脂肪液化或是伤口感染出现长期的伤口不愈合，可使用生理盐水冲洗创面，碘伏进行消炎，然后配合使用于氏收口方之类消炎生肌疗效的药物进行治疗。上文我们为大家详细的介绍了剖妇产伤口护理，希望对各位新妈妈们可以有所帮助，新妈妈们在医院的时候一定要按照医生的嘱托去饮食和护理伤口。各位新妈妈们一定记得照顾好自己，快速的恢复身体，这样才可以给宝宝提供充足的营养。' },
        { title: '剖腹产优缺点', content: '优点\n' +
              '(1)由于某种原因，绝对不可能从阴道分娩时，施行剖腹产可以挽救母婴的生命。\n' +
              '(2)剖腹产的手术指征明确，麻醉和手术一般都很顺利。\n' +
              '(3)如果施行选择性剖腹产，于宫缩尚未开始前就已施行手术，可以免去母亲遭受阵痛之苦。\n' +
              '(4)腹腔内如有其它疾病时，也可一并处理，如合并卵巢肿瘤或浆膜下子宫肌瘤，均可同时切除。\n' +
              '(5)做结扎手术也很方便。\n' +
              '(6)对已有不宜保留子宫的情况，如严重感染，不全子宫破裂，多发性子宫肌瘤等，亦可同时切除子宫。\n' +
              '(7)由于近年剖腹产术安全性的提高，许多妊娠并发病和妊娠合并症的中止妊娠，临床医生选择了剖腹产术，减少了并发病和合并症对母儿的影响\n' +
              '剖腹产的缺点：\n' +
              '(1)剖腹手术对母体的精神上和肉体上都是个创伤。\n' +
              '(2)手术时麻醉意外虽然极少发生，但有可能发生。\n' +
              '(3)手术时可能发生大出血及副损伤，损伤腹内其它器官，术后也可能发生泌尿、心血管、呼吸等系统的合并症。\n' +
              '(4)手术中即或平安无事，但术后有可能发生子宫切口愈合不良，晚期产后流血，腹壁窦道形成，切口长期不愈合.肠粘连或子宫内膜异位症等。\n' +
              '(5)术后子宫及全身的恢复都比自然分娩慢。\n' +
              '(6)再次妊娠和分娩时、有可能从原子宫切口处裂开，而发生子宫破裂，如果原切口愈合不良，分娩时亦需再次剖腹，故造成远期不良影响。\n' +
              '(7)剖腹产的新生儿，有可能发生呼吸窘迫综合征。根据上述，剖腹产既有优点，又有缺点，并非绝对安全。除了因挽救母婴必须做剖宫产外，如果没有手术指征，应尽量不做，争取采用顺产的方式分娩。' },
        { title: '顺转剖', content: '顺转剖就是宝妈们在分娩的时候，初始是选择顺产，但因为一些特殊原因不得不转为剖宫产，这种情况就是顺转剖\n' +
              '什么情况下要顺转刨？\n' +
              '★从宝妈的情况来看：\n' +
              '1、已经挂了催产素，但是毫无临产的症状;\n' +
              '2、宝妈阵痛持续时间长，宫口超过12小时还无法打开，且已经出现了子宫感染的情况;\n' +
              '3、宝妈的产道不够宽，宝宝很难出来;\n' +
              '4、宝妈羊水少或者羊水二度浑浊;\n' +
              '5、宝妈出现妊娠期高血压或糖尿病并发症;\n' +
              '\n' +
              '★从宝宝的情况来看：\n' +
              '1、顺产时胎位转向不正，胎头不是朝下;\n' +
              '2、顺产过程中，胎儿的胎心过快或者突然下降;\n' +
              '3、胎儿头骨比较硬，难以入盆导致顺产困难;\n' +
              '4、胎头高位，宫口经过一段时间仍然无法完全打开;\n' +
              '5、出现胎儿窘迫的情况，或异常出血的情况;\n' +
              '6、出现脐带压迫的情况，或脐带脱垂的情况。' },
      ],
    }
  },
  methods: {
    toDetail(d) {
      this.current = d;
      this.isDetail = true;
    }
  }
}
</script>

<style scoped>
  .container {
    margin: 20px auto;
    max-width: 1000px;
    min-width: 800px;
  }
  .title {
    font-size: 20px;
    font-weight: bold;
  }
  .topic {
    margin-top: 20px;
    margin-bottom: 10px;
    font-weight: bold;
  }
  .item {
    padding: 10px;
    border-bottom: 1px solid #eee;
  }
  .item:hover {
    background-color: #eee;
    cursor: pointer;
  }
  .detail-title {
    font-size: 18px;
    font-weight: bold;
    text-align: center;
  }
  .content {
    margin-top: 40px;
    white-space: pre-line;
    line-height: 2;
  }
</style>